{
    "instaloader": {
        "node_type": "Post",
        "version": "4.2.8"
    },
    "node": {
        "__typename": "GraphImage",
        "accessibility_caption": "Image may contain: text that says 'Ifyou want rape victims suffering from extreme body If shame come to yoga suggest using image of woman in bra with your advertising. Such advertising doesn't promote a healer. These women already they could and that would be better for the planet someone like them wasting their to become someone as strong those You know it to shift their perspective themselves You understand that deep existential crisis they are experiencing. Strong, beautiful women giving up on themselves something didn't do themselves. Help them feel matter. FEELING GOOD IN THEIR BODIES MATTERS. FEELING CAPABLE IN THEIR BODIES MATTERS.'",
        "comments_disabled": false,
        "dimensions": {
            "height": 1080,
            "width": 1080
        },
        "display_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/d02175a4ab6680b189a6843c40c4f6a2/5D969D8B/t51.2885-15/e35/62231762_1298469103636187_210518836474714609_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
        "edge_liked_by": {
            "count": 11
        },
        "edge_media_preview_like": {
            "count": 11
        },
        "edge_media_to_caption": {
            "edges": [
                {
                    "node": {
                        "text": "How you advertise your services is so important. I read an article today about how to help victims of sexual assault work through their body image issues. The writer was clearly deaf to the REAL voices of #sexualassaultsurvivors and made assumptions about the psychology of women. Plus, it ignored the problems of depression causing women to not feel good enough or that they deserve to exercise. This belief can come from internalized criticism of their body and a despairing belief that no matter what they do they will never be strong or attractive enough, so why bother? For women struggling with financial problems or unemployment or caring for their children, going to the gym feels like a waste of time when they have other demanding needs. But what about the women assaulted by coworkers (and thus quit or were fired) or by someone in control of their money? How are they supposed to pay for your yoga classes? Listen, I’m all about women healing, but you have to meet them at their level. Some women are in emotional hell right now and it will take the smallest steps in the human experience to get them moving. Start there.\nAdvertising #yoga or #dance to victims of assault needs to have different imagery. You can’t stick a skinny model with her leg over her head as the image. Instead, you need to show women who aren’t perfect all together trying, with their fit instructor gently assisting them. THAT’S what makes them say “that can be me, too.” I want THAT #metoo \nInstructors who promote themselves rather than focus on their clients are not healers. They’re opportunists, and I won’t stand for people trying to make a buck off a niche market that includes women who just want their lives and a sense of safety back. \nI can tell you what your clients want you to say: “I know your weight has fluctuated. I know you’re financially struggling and may feel guilty about coming to this class. I know you don’t feel young and attractive and are working through those years of your life you spent with that abuser. I know you’re hurting, and I want you to know that I’m going to help you. You’re welcome to tell me what you need.” The tears you will bring to eyes will be worth it."
                    }
                }
            ]
        },
        "edge_media_to_comment": {
            "count": 0
        },
        "id": "2059550704665999609",
        "is_video": false,
        "owner": {
            "id": "8365061489"
        },
        "shortcode": "ByU_nQ0hbj5",
        "taken_at_timestamp": 1559737598,
        "thumbnail_resources": [
            {
                "config_height": 150,
                "config_width": 150,
                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/c5cd75b245aa8d875add9846ed7f2281/5D8943C9/t51.2885-15/e35/s150x150/62231762_1298469103636187_210518836474714609_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
            },
            {
                "config_height": 240,
                "config_width": 240,
                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/0c6f76ed8dc6446ac9828da92ab2ceb6/5D7F8683/t51.2885-15/e35/s240x240/62231762_1298469103636187_210518836474714609_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
            },
            {
                "config_height": 320,
                "config_width": 320,
                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/2e1d92f92dde724edb267a489cea10c4/5DC2EF39/t51.2885-15/e35/s320x320/62231762_1298469103636187_210518836474714609_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
            },
            {
                "config_height": 480,
                "config_width": 480,
                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/632bcdad479591e80a3cc2c24a6cc080/5D8EC763/t51.2885-15/e35/s480x480/62231762_1298469103636187_210518836474714609_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
            },
            {
                "config_height": 640,
                "config_width": 640,
                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/119093b400c6263370d591bb5ae70b32/5DC20B6E/t51.2885-15/sh0.08/e35/s640x640/62231762_1298469103636187_210518836474714609_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
            }
        ],
        "thumbnail_src": "https://instagram.faal2-1.fna.fbcdn.net/vp/119093b400c6263370d591bb5ae70b32/5DC20B6E/t51.2885-15/sh0.08/e35/s640x640/62231762_1298469103636187_210518836474714609_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
    }
}