{
    "instaloader": {
        "node_type": "Post",
        "version": "4.2.8"
    },
    "node": {
        "__typename": "GraphSidecar",
        "accessibility_caption": "Image may contain: text",
        "caption_is_edited": true,
        "comments_disabled": false,
        "dimensions": {
            "height": 744,
            "width": 1080
        },
        "display_resources": [
            {
                "config_height": 440,
                "config_width": 640,
                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/8d9704c88ab974220b15ae29f8c5ac50/5D836BC2/t51.2885-15/sh0.08/e35/s640x640/64252345_436298610259763_6496020972127926877_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
            },
            {
                "config_height": 516,
                "config_width": 750,
                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/ba61f18d85aedd0fc62c74a30f890911/5DA011C2/t51.2885-15/sh0.08/e35/s750x750/64252345_436298610259763_6496020972127926877_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
            },
            {
                "config_height": 744,
                "config_width": 1080,
                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/3115d3da99695f5ef2a39798387d553a/5D904A27/t51.2885-15/e35/64252345_436298610259763_6496020972127926877_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
            }
        ],
        "display_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/3115d3da99695f5ef2a39798387d553a/5D904A27/t51.2885-15/e35/64252345_436298610259763_6496020972127926877_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
        "edge_liked_by": {
            "count": 257
        },
        "edge_media_preview_comment": {
            "count": 12,
            "edges": [
                {
                    "node": {
                        "created_at": 1560114973,
                        "did_report_as_spam": false,
                        "edge_liked_by": {
                            "count": 0
                        },
                        "id": "18041342431144668",
                        "owner": {
                            "id": "5777517621",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/8c915f2b905af3bdeb1399f2b15ad758/5D925327/t51.2885-19/s150x150/20213985_2008768419346880_1365364343847256064_a.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "mhv.90"
                        },
                        "text": "@hamed.sh313 ریشه همه چی تو بد حجابیه. دروغ، تزویر، ریا کاری ربا خواری دزدی و... روز به روز بر ایمان مردم افزوده الحمدلله. الهی شکر. اعتماد مردم به مراجع دینی و جامعه روحانیت و در کل دین و  مذهب روز به روز داره بیشتر میشه. قالتاق های مملکت همه بی حجاب و کراوات زده و سه تیغه هستن. بجای جای مهر روی پیشونی هم تتوی برندهای الکلی و نماد های فراماسونی دارن. این چیزی هست که شما میبینین حامد جان؟ جوانی که گرگ شده علتش بی حجابیه. سیاست های غلط توی مشغول کردنش به تحصیل به هر قیمتی و بالا بردن سطح توقعش و در نتیجه بیکاری، بی ثباتی و ... هم هیچ دخلی ندارن. رانت و پارتی بازی و از ما بهترون هم که همیشه بوده و هست. بی حجابیه که ملت رو گرگ کرده. یکی از دلایلش البته اینه. اینکه هیچ آینده ای برای خودش نمیبینه و هیچ امیدی برای پیشرفت نداره هم یکی از عوامل که البته اونقدرا اهمیت نداره. هیچ کس نگفت که ولنگاری توی غرب نیست و تبعات نداره. اون هست. اما انسانیت هم هست. چقدر انسان هستیم؟ چقدر مسئولینمون انسان هستن؟ چقدر کثافت کاری توی این مملکت هست که باید دغدغه اول همه باشه. از رهبری تا من ذلیل تر از همه. اما دلخوشیمون این شده که گیر بدیم به خورد و خوراک ملت و پوششون. نه. این روش چهل ساله امتحان شده. این نتیجشه. ساسی مانکن برای نسل مظلوم آیندمون بولد بشه. بعد بهش میگی علی کی بود؟ علی چی میگه؟ بووووق. هیچی نمیدونه. پارادوکسی که نظام جمهوری اسلامی با تزویر ایجاد کرده سالها گریبان گیر نسل ها میشه و تهش هم به هدف حفظ حکومت ختم میشه دوست من. اسلام تنها قربانی انقلاب ایران شد. دینی که هیچ جای این مملکت نشونه ای ازش دیده نمیشه. جز حدود شرعیش روی تن جوانی که ماه رمضون سیگار کشیده😉. اینه دیدگاهی که که هرگز درست نمیشه چون مغز ها شستشو‌داده شدن و بت هایی از انسان ها ساخته شدن که دیگه به پاشون طلا ریخته نمیشه. به پاشون یمان و اعتقاد و عقل و تفکر ریخته میشه. خدا خودش جای حق نشسته. نرسه اون روزی که ببینیم ای وای اسلام چی بوده و ما پیرو چه دینی بودیم. یا حق.",
                        "viewer_has_liked": false
                    }
                },
                {
                    "node": {
                        "created_at": 1560344201,
                        "did_report_as_spam": false,
                        "edge_liked_by": {
                            "count": 0
                        },
                        "id": "17887336372359030",
                        "owner": {
                            "id": "13559193657",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/0f53360c2a4f3ed9f92288e47c085de2/5D95A82B/t51.2885-19/s150x150/58961849_653385545084333_1793066850859352064_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "memohajer"
                        },
                        "text": "هر جامعه ای نیازمند قانونه . اگه قانون نباشه حکومت جنگل حکم فرما میشه . یکی از قوانین مشترک در تمام جوامع بشری قانون رعایت حریم خصوصی اشخاص در نگاه اجتماعیه که بحث جنسی هم شامل میشه . باید فرهنگ برخورد با جنس مخالف برای هر دوطرف مرد و زن تعریف بشه آموزش داده بشه تا بتونن با آگاهی در کنار هم زندگی کنن . اعتراض و پیگیری قانونی در ایران به شدت یک #تابو بزرگ و خطرناکه . از ترس آبرو ، قضاوت ها و عواقب جامعه ، خانواده ای که عضوی از آنها درگیر تجاوز شده اند از پیگیری قانونی فراری هستند . تفکر تعصبی جامعه و افمکار عمومی در این موضوع باید تغییر کنه تا اجرای قانون بتونه موثر واقع بشه . تربیت خانوادگی در افراد بسیار مهم و قابل توجه . وقتی تربیت خانوداگی صحیح باشه و حرمت اشخاص حفظ بشه عملا مشکلی به نام تجاوز به حریم خصوصی افراد نخواهیم داشت . برای مرد یا زنی که از سن معقول تربیتی گذشته باید با راهکاری قانونی جلوی هنجارشکنی هایش گرفته شود ولی کودکان امروز : به امید اینکه فرزندان امروز ، کودکان حال جامعه ، با تربیتی درست و منطقی بدور از تعصبات مخرب ، مردان و زنان با فرهتگ و قانونمند جامعه آینده ما باشند .",
                        "viewer_has_liked": false
                    }
                }
            ]
        },
        "edge_media_preview_like": {
            "count": 257,
            "edges": []
        },
        "edge_media_to_caption": {
            "edges": [
                {
                    "node": {
                        "text": "چند دقیقه منطق و تفکر☺\nیک دختری توسط یک راننده تاکسی مورد تعرض قرار میگیره_ضربه روحی میخوره_و دوستانش و قانون به او این اجازه رو میدن که با پیگیری قانونی مشخصات اون راننده تاکسی رو بده تا با او برخورد بشه.\n⭕پرده اول:\nاو(دختر) به دلیل رفتار بد راننده و #تجاوز به حریم شخصیش از قانون و جامعه میخواد نسبت به این موضوع واکنش نشون بدن\n⭕پرده دوم:\n#قانون از شهروندان جامعه میخواد حداقل نوع پوشش رو در مکان های عمومی رعایت کنن و همون قانون اجازه پیگیری  و برخورد با افراد متجاوز به قانون رو داده\n⭕پرده سوم:\nیک #روشنفکر لیبرال میگه جامعه رو آزاد بزاریم محدودیت های بین زن و مرد برداشته بشه و با کنار زدن نگاه جنسیتی ارتباط زن و مرد عادی بشه و حدود های دینی از بین بره\n+تو این شرایط اون #دختر نه حق داره بترسه و ن حق داره از جامعه و قانون بخواد کسی اون رفتار #راننده_تاکسی رو پیگیری کنه_چون خود جامعه خواسته این یک رفتار عادی به شمار بیاد(یکی از مصادیق #آزادی)\n⭕پرده چهارم:\nجامعه ای که تحت فرهنگ لیبرالی به این باور برسه که رابطه آزاد دختر و پسر و حجاب آزاد در جامعه به کم شدن فساد(عادی شدن!) کمک میکنه در برابر هیچ تعرض و تجاوزی نمیتونه واکنش نشون بده_چون دختر خودش(از طرف یک پدر در جامعه) داره در جامعه ای زندگی میکنه ب دلیل آزادی بسیاری از رفتارهای فردی افرادش نه اسم تعرض داره نه تجاوز.\n..\n✔پ.ن:برای درک متن بالا آمار تجاوز های جنسی در اروپا و آمریکا رو سرچ کنید_همچنین آمار سکوت در برابر تجاوز به علت نگه داشتن آبروی شخصی در واقع قربانی شدن فرد به دلیل عرف غلط جامعه.\nهشتگ می تو #metoo گوشه ای از این خروجی در دنیا است.\n#اسنپ\n#قانون\n#حجاب\n#رفتار_اجتماعی"
                    }
                }
            ]
        },
        "edge_media_to_comment": {
            "count": 12
        },
        "edge_media_to_parent_comment": {
            "count": 12,
            "edges": [
                {
                    "node": {
                        "created_at": 1560068881,
                        "did_report_as_spam": false,
                        "edge_liked_by": {
                            "count": 1
                        },
                        "edge_threaded_comments": {
                            "count": 0,
                            "edges": [],
                            "page_info": {
                                "end_cursor": null,
                                "has_next_page": false
                            }
                        },
                        "id": "18073847194002007",
                        "owner": {
                            "id": "1625397189",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/f65e9e657ea6511eb416c4d30dc05c3f/5D92F258/t51.2885-19/s150x150/53239518_2490982264305090_4548361153759150080_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "fateh.smj"
                        },
                        "text": "👌👌👌",
                        "viewer_has_liked": false
                    }
                },
                {
                    "node": {
                        "created_at": 1560070081,
                        "did_report_as_spam": false,
                        "edge_liked_by": {
                            "count": 1
                        },
                        "edge_threaded_comments": {
                            "count": 1,
                            "edges": [
                                {
                                    "node": {
                                        "created_at": 1560071273,
                                        "did_report_as_spam": false,
                                        "edge_liked_by": {
                                            "count": 0
                                        },
                                        "id": "18037411036161060",
                                        "owner": {
                                            "id": "3627683343",
                                            "is_verified": false,
                                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/5febb4c82c763dfcbf89bc6e213fcdda/5D88D4DB/t51.2885-19/s150x150/31978915_163771307631960_2333681741685850112_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                                            "username": "hamed.sh313"
                                        },
                                        "text": "@m_h_raja ✌",
                                        "viewer_has_liked": false
                                    }
                                }
                            ],
                            "page_info": {
                                "end_cursor": null,
                                "has_next_page": false
                            }
                        },
                        "id": "18073007995039534",
                        "owner": {
                            "id": "7725353605",
                            "is_verified": false,
                            "profile_pic_url": "https://scontent-iad3-1.cdninstagram.com/vp/ba523e7703bfa4a2af716e67ea7aa12c/5DA39AF1/t51.2885-19/44884218_345707102882519_2446069589734326272_n.jpg?_nc_ht=scontent-iad3-1.cdninstagram.com",
                            "username": "m_h_raja"
                        },
                        "text": "ایول الله 👍❤️",
                        "viewer_has_liked": false
                    }
                },
                {
                    "node": {
                        "created_at": 1560073869,
                        "did_report_as_spam": false,
                        "edge_liked_by": {
                            "count": 2
                        },
                        "edge_threaded_comments": {
                            "count": 0,
                            "edges": [],
                            "page_info": {
                                "end_cursor": null,
                                "has_next_page": false
                            }
                        },
                        "id": "17847873733462679",
                        "owner": {
                            "id": "4061356362",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/c20e2328911b54d309d8df07853b1bce/5D8A0C04/t51.2885-19/s150x150/23348082_128606121176568_3042614352143187968_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "s_ahmadbegi"
                        },
                        "text": "البته در نگاه اینا، هر رابطه، تماس یا هر چیزی تا وقتی که دو طرف راضی باشن، تجاوز و تعرض حساب نمیشه. یعنی میگن این ذوابط باید آزاد باشه، و هیچ حد و مرزی هم براش قائل نیستند، به جز عدم رضایت یا تمایل یکی از طرفین. اما توجه ندارند که وقتی آزاد گذاشتی، وقتی نه کسی برای ظاهر و پوشش محدودیتی قائل شد، نه برای نگاه و لذتجویی، افزایش این مسائل و مشکلات اجتناب ناپذیره.",
                        "viewer_has_liked": false
                    }
                },
                {
                    "node": {
                        "created_at": 1560074794,
                        "did_report_as_spam": false,
                        "edge_liked_by": {
                            "count": 1
                        },
                        "edge_threaded_comments": {
                            "count": 0,
                            "edges": [],
                            "page_info": {
                                "end_cursor": null,
                                "has_next_page": false
                            }
                        },
                        "id": "17963027623277132",
                        "owner": {
                            "id": "5841477771",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/68447020e7e28287081662821589db09/5D9928BA/t51.2885-19/s150x150/59267595_633319763806417_3680074600806350848_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "ftmh__f"
                        },
                        "text": "👏👌",
                        "viewer_has_liked": false
                    }
                },
                {
                    "node": {
                        "created_at": 1560075666,
                        "did_report_as_spam": false,
                        "edge_liked_by": {
                            "count": 1
                        },
                        "edge_threaded_comments": {
                            "count": 0,
                            "edges": [],
                            "page_info": {
                                "end_cursor": null,
                                "has_next_page": false
                            }
                        },
                        "id": "17851957015450315",
                        "owner": {
                            "id": "8434298168",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/7d76219396178e001be46a81475be3db/5D941B56/t51.2885-19/s150x150/62268292_2287725294809275_3935859557053497344_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "hastoor76317"
                        },
                        "text": "چقد وحشتناک شده",
                        "viewer_has_liked": false
                    }
                },
                {
                    "node": {
                        "created_at": 1560080697,
                        "did_report_as_spam": false,
                        "edge_liked_by": {
                            "count": 1
                        },
                        "edge_threaded_comments": {
                            "count": 1,
                            "edges": [
                                {
                                    "node": {
                                        "created_at": 1560080979,
                                        "did_report_as_spam": false,
                                        "edge_liked_by": {
                                            "count": 1
                                        },
                                        "id": "18074464417017201",
                                        "owner": {
                                            "id": "3627683343",
                                            "is_verified": false,
                                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/5febb4c82c763dfcbf89bc6e213fcdda/5D88D4DB/t51.2885-19/s150x150/31978915_163771307631960_2333681741685850112_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                                            "username": "hamed.sh313"
                                        },
                                        "text": "@yunes_km در غرب این کار یک تعرض کوچیک محسوب میشه که پیگرد قانونی خاصی نداره برای درک بیشتر مصادیق sexual harasment رو سرچ کنید اگر توانایی ترجمه انگلیسی رو دارین",
                                        "viewer_has_liked": false
                                    }
                                }
                            ],
                            "page_info": {
                                "end_cursor": null,
                                "has_next_page": false
                            }
                        },
                        "id": "18072681442018382",
                        "owner": {
                            "id": "6591568650",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/acd3f250735b9250939aa5326c898985/5DC29589/t51.2885-19/s150x150/47080200_2055976684458840_4485971973486149632_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "yunes_km"
                        },
                        "text": "تو پرده چهارم که گفتید نباید ناراحت می شده این غلطه از نظر اونها آزادی تا جایی معنا داره که آزادی دیگری رو به خطر نندازه یعنی روابط ازاد در صورتی ممکنه که هر دو رضایت داشته باشند وگرنه میشه مصداق تجاوز همون طور که توی غرب این کار تجاوز محسوب میشه",
                        "viewer_has_liked": false
                    }
                },
                {
                    "node": {
                        "created_at": 1560109080,
                        "did_report_as_spam": false,
                        "edge_liked_by": {
                            "count": 1
                        },
                        "edge_threaded_comments": {
                            "count": 2,
                            "edges": [
                                {
                                    "node": {
                                        "created_at": 1560109416,
                                        "did_report_as_spam": false,
                                        "edge_liked_by": {
                                            "count": 2
                                        },
                                        "id": "18073590079049499",
                                        "owner": {
                                            "id": "3627683343",
                                            "is_verified": false,
                                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/5febb4c82c763dfcbf89bc6e213fcdda/5D88D4DB/t51.2885-19/s150x150/31978915_163771307631960_2333681741685850112_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                                            "username": "hamed.sh313"
                                        },
                                        "text": "@mhv.90 اتفاقا من حداقل تعصبات مذهبی رو نوشتم داداش_خروجی ولنگاری پوشش رو در غرب گمان کنم نمیدونی_در سایت گاردیان در مورد امار تجاوزات و تعرضات در لندن سرچ کن_همچنین امار غیر رسمی ک گزارش نشده رو هم ببین_صد البته جوانی که گرگ شده یکی از دلایلش همین بد حجابیه",
                                        "viewer_has_liked": false
                                    }
                                },
                                {
                                    "node": {
                                        "created_at": 1560114973,
                                        "did_report_as_spam": false,
                                        "edge_liked_by": {
                                            "count": 0
                                        },
                                        "id": "18041342431144668",
                                        "owner": {
                                            "id": "5777517621",
                                            "is_verified": false,
                                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/8c915f2b905af3bdeb1399f2b15ad758/5D925327/t51.2885-19/s150x150/20213985_2008768419346880_1365364343847256064_a.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                                            "username": "mhv.90"
                                        },
                                        "text": "@hamed.sh313 ریشه همه چی تو بد حجابیه. دروغ، تزویر، ریا کاری ربا خواری دزدی و... روز به روز بر ایمان مردم افزوده الحمدلله. الهی شکر. اعتماد مردم به مراجع دینی و جامعه روحانیت و در کل دین و  مذهب روز به روز داره بیشتر میشه. قالتاق های مملکت همه بی حجاب و کراوات زده و سه تیغه هستن. بجای جای مهر روی پیشونی هم تتوی برندهای الکلی و نماد های فراماسونی دارن. این چیزی هست که شما میبینین حامد جان؟ جوانی که گرگ شده علتش بی حجابیه. سیاست های غلط توی مشغول کردنش به تحصیل به هر قیمتی و بالا بردن سطح توقعش و در نتیجه بیکاری، بی ثباتی و ... هم هیچ دخلی ندارن. رانت و پارتی بازی و از ما بهترون هم که همیشه بوده و هست. بی حجابیه که ملت رو گرگ کرده. یکی از دلایلش البته اینه. اینکه هیچ آینده ای برای خودش نمیبینه و هیچ امیدی برای پیشرفت نداره هم یکی از عوامل که البته اونقدرا اهمیت نداره. هیچ کس نگفت که ولنگاری توی غرب نیست و تبعات نداره. اون هست. اما انسانیت هم هست. چقدر انسان هستیم؟ چقدر مسئولینمون انسان هستن؟ چقدر کثافت کاری توی این مملکت هست که باید دغدغه اول همه باشه. از رهبری تا من ذلیل تر از همه. اما دلخوشیمون این شده که گیر بدیم به خورد و خوراک ملت و پوششون. نه. این روش چهل ساله امتحان شده. این نتیجشه. ساسی مانکن برای نسل مظلوم آیندمون بولد بشه. بعد بهش میگی علی کی بود؟ علی چی میگه؟ بووووق. هیچی نمیدونه. پارادوکسی که نظام جمهوری اسلامی با تزویر ایجاد کرده سالها گریبان گیر نسل ها میشه و تهش هم به هدف حفظ حکومت ختم میشه دوست من. اسلام تنها قربانی انقلاب ایران شد. دینی که هیچ جای این مملکت نشونه ای ازش دیده نمیشه. جز حدود شرعیش روی تن جوانی که ماه رمضون سیگار کشیده😉. اینه دیدگاهی که که هرگز درست نمیشه چون مغز ها شستشو‌داده شدن و بت هایی از انسان ها ساخته شدن که دیگه به پاشون طلا ریخته نمیشه. به پاشون یمان و اعتقاد و عقل و تفکر ریخته میشه. خدا خودش جای حق نشسته. نرسه اون روزی که ببینیم ای وای اسلام چی بوده و ما پیرو چه دینی بودیم. یا حق.",
                                        "viewer_has_liked": false
                                    }
                                }
                            ],
                            "page_info": {
                                "end_cursor": null,
                                "has_next_page": false
                            }
                        },
                        "id": "18058059001103450",
                        "owner": {
                            "id": "5777517621",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/8c915f2b905af3bdeb1399f2b15ad758/5D925327/t51.2885-19/s150x150/20213985_2008768419346880_1365364343847256064_a.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "mhv.90"
                        },
                        "text": "منطقی نیست. آیا در جوامعی که آزادی پوشش هست تعرض و تجاوز پیگیری نمیشه؟! این توجیح ها از نظر من چیزی جز تعصبات مذهبی نیست. چون حتی پیغمبر هم وظیفه تامین آخرت مردم رو به زور و جبر و وضع قانون نداشت. ما خیلی زرنگیم بپردازیم به اصول دین توی مملکتمون. ببینیم چه به روز جوونا آوردیم که انقدر دین ستیز شدن. چرا یه بچه دهه هشتادی مثل گودزیلا غیر قابل کنترل میشه حتی برای خانواده. انقدر به جزئیات گیر ندیم. خدا قراره تایین کنه بهشت و جهنم رو. ما اگه خیلی هنرمندیم دیده فرو بریم به گریبان خویش و ببینیم داریم زیر پرچم کی سینه میزنیم. ببینیم آیا اسلامی توی مملکت دیده میشه که حالا حجابش انقدر توی بوغ و کرنا میشه؟! امان از سوپاپ اطمینان",
                        "viewer_has_liked": false
                    }
                },
                {
                    "node": {
                        "created_at": 1560344201,
                        "did_report_as_spam": false,
                        "edge_liked_by": {
                            "count": 0
                        },
                        "edge_threaded_comments": {
                            "count": 0,
                            "edges": [],
                            "page_info": {
                                "end_cursor": null,
                                "has_next_page": false
                            }
                        },
                        "id": "17887336372359030",
                        "owner": {
                            "id": "13559193657",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/0f53360c2a4f3ed9f92288e47c085de2/5D95A82B/t51.2885-19/s150x150/58961849_653385545084333_1793066850859352064_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "memohajer"
                        },
                        "text": "هر جامعه ای نیازمند قانونه . اگه قانون نباشه حکومت جنگل حکم فرما میشه . یکی از قوانین مشترک در تمام جوامع بشری قانون رعایت حریم خصوصی اشخاص در نگاه اجتماعیه که بحث جنسی هم شامل میشه . باید فرهنگ برخورد با جنس مخالف برای هر دوطرف مرد و زن تعریف بشه آموزش داده بشه تا بتونن با آگاهی در کنار هم زندگی کنن . اعتراض و پیگیری قانونی در ایران به شدت یک #تابو بزرگ و خطرناکه . از ترس آبرو ، قضاوت ها و عواقب جامعه ، خانواده ای که عضوی از آنها درگیر تجاوز شده اند از پیگیری قانونی فراری هستند . تفکر تعصبی جامعه و افمکار عمومی در این موضوع باید تغییر کنه تا اجرای قانون بتونه موثر واقع بشه . تربیت خانوادگی در افراد بسیار مهم و قابل توجه . وقتی تربیت خانوداگی صحیح باشه و حرمت اشخاص حفظ بشه عملا مشکلی به نام تجاوز به حریم خصوصی افراد نخواهیم داشت . برای مرد یا زنی که از سن معقول تربیتی گذشته باید با راهکاری قانونی جلوی هنجارشکنی هایش گرفته شود ولی کودکان امروز : به امید اینکه فرزندان امروز ، کودکان حال جامعه ، با تربیتی درست و منطقی بدور از تعصبات مخرب ، مردان و زنان با فرهتگ و قانونمند جامعه آینده ما باشند .",
                        "viewer_has_liked": false
                    }
                }
            ],
            "page_info": {
                "end_cursor": null,
                "has_next_page": false
            }
        },
        "edge_media_to_sponsor_user": {
            "edges": []
        },
        "edge_media_to_tagged_user": {
            "edges": [
                {
                    "node": {
                        "user": {
                            "full_name": "Mahnaz Afshar",
                            "id": "241999282",
                            "is_verified": true,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/1f590950e91712b1ab8df6206fc782ab/5D808B90/t51.2885-19/s150x150/51830396_393680181446285_6644352640710868992_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "mahnaz_afshar"
                        },
                        "x": 0.15395284,
                        "y": 0.4125809
                    }
                },
                {
                    "node": {
                        "user": {
                            "full_name": "مژده لواسانى",
                            "id": "550317990",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/173ff0d96ad43644f2bed7f14108d70c/5DC327AB/t51.2885-19/s150x150/54732482_2134789356633842_4401645655043342336_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "mozhdeh_lavasani"
                        },
                        "x": 0.70943135,
                        "y": 0.47301754
                    }
                },
                {
                    "node": {
                        "user": {
                            "full_name": "تهمینه میلانی",
                            "id": "1497940379",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/7227e7eca6b9c63a603b2ef4c64472d1/5DA5119A/t51.2885-19/s150x150/62220723_322931465307943_4504689350767804416_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "tahminehmilani"
                        },
                        "x": 0.33009708,
                        "y": 0.2252273
                    }
                },
                {
                    "node": {
                        "user": {
                            "full_name": "چــادری ها",
                            "id": "1926956316",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/f8329f8bd63a247b5b14b145bbb27f01/5D9395D5/t51.2885-19/s150x150/61919761_389055821704429_1236291174919045120_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "chadori_ha"
                        },
                        "x": 0.8377254,
                        "y": 0.15471785
                    }
                },
                {
                    "node": {
                        "user": {
                            "full_name": "⤵چـــــــــــادرخاکــــی⤵",
                            "id": "2198192962",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/a8993d1ec6dcdec953b1b46488694c29/5D927791/t51.2885-19/s150x150/17596752_200508217107584_8588617308350447616_a.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "chadorkhaki2"
                        },
                        "x": 0.4486824,
                        "y": 0.5495706
                    }
                },
                {
                    "node": {
                        "user": {
                            "full_name": "ریحانه | Reyhaneh",
                            "id": "2229134530",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/462ac33c91a11553aa4bd6530fec9e62/5D87C41C/t51.2885-19/s150x150/43742323_117624749173852_1867359150741127168_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "khamenei_reyhaneh"
                        },
                        "x": 0.22191402,
                        "y": 0.7429679
                    }
                },
                {
                    "node": {
                        "user": {
                            "full_name": "چادریها 313 ❤",
                            "id": "5595226915",
                            "is_verified": false,
                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/7ed0b0360a7d0a076ac62ad5c3859ae7/5D8DE594/t51.2885-19/s150x150/19120457_143727069510584_8596764869900894208_a.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                            "username": "chadoriha_313"
                        },
                        "x": 0.8578364,
                        "y": 0.61504364
                    }
                }
            ]
        },
        "edge_sidecar_to_children": {
            "edges": [
                {
                    "node": {
                        "__typename": "GraphImage",
                        "accessibility_caption": "Image may contain: text",
                        "dimensions": {
                            "height": 744,
                            "width": 1080
                        },
                        "display_resources": [
                            {
                                "config_height": 440,
                                "config_width": 640,
                                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/8d9704c88ab974220b15ae29f8c5ac50/5D836BC2/t51.2885-15/sh0.08/e35/s640x640/64252345_436298610259763_6496020972127926877_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
                            },
                            {
                                "config_height": 516,
                                "config_width": 750,
                                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/ba61f18d85aedd0fc62c74a30f890911/5DA011C2/t51.2885-15/sh0.08/e35/s750x750/64252345_436298610259763_6496020972127926877_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
                            },
                            {
                                "config_height": 744,
                                "config_width": 1080,
                                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/3115d3da99695f5ef2a39798387d553a/5D904A27/t51.2885-15/e35/64252345_436298610259763_6496020972127926877_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
                            }
                        ],
                        "display_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/3115d3da99695f5ef2a39798387d553a/5D904A27/t51.2885-15/e35/64252345_436298610259763_6496020972127926877_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                        "edge_media_to_tagged_user": {
                            "edges": [
                                {
                                    "node": {
                                        "user": {
                                            "full_name": "Mahnaz Afshar",
                                            "id": "241999282",
                                            "is_verified": true,
                                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/1f590950e91712b1ab8df6206fc782ab/5D808B90/t51.2885-19/s150x150/51830396_393680181446285_6644352640710868992_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                                            "username": "mahnaz_afshar"
                                        },
                                        "x": 0.15395284,
                                        "y": 0.4125809
                                    }
                                },
                                {
                                    "node": {
                                        "user": {
                                            "full_name": "مژده لواسانى",
                                            "id": "550317990",
                                            "is_verified": false,
                                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/173ff0d96ad43644f2bed7f14108d70c/5DC327AB/t51.2885-19/s150x150/54732482_2134789356633842_4401645655043342336_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                                            "username": "mozhdeh_lavasani"
                                        },
                                        "x": 0.70943135,
                                        "y": 0.47301754
                                    }
                                },
                                {
                                    "node": {
                                        "user": {
                                            "full_name": "تهمینه میلانی",
                                            "id": "1497940379",
                                            "is_verified": false,
                                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/7227e7eca6b9c63a603b2ef4c64472d1/5DA5119A/t51.2885-19/s150x150/62220723_322931465307943_4504689350767804416_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                                            "username": "tahminehmilani"
                                        },
                                        "x": 0.33009708,
                                        "y": 0.2252273
                                    }
                                },
                                {
                                    "node": {
                                        "user": {
                                            "full_name": "چــادری ها",
                                            "id": "1926956316",
                                            "is_verified": false,
                                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/f8329f8bd63a247b5b14b145bbb27f01/5D9395D5/t51.2885-19/s150x150/61919761_389055821704429_1236291174919045120_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                                            "username": "chadori_ha"
                                        },
                                        "x": 0.8377254,
                                        "y": 0.15471785
                                    }
                                },
                                {
                                    "node": {
                                        "user": {
                                            "full_name": "⤵چـــــــــــادرخاکــــی⤵",
                                            "id": "2198192962",
                                            "is_verified": false,
                                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/a8993d1ec6dcdec953b1b46488694c29/5D927791/t51.2885-19/s150x150/17596752_200508217107584_8588617308350447616_a.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                                            "username": "chadorkhaki2"
                                        },
                                        "x": 0.4486824,
                                        "y": 0.5495706
                                    }
                                },
                                {
                                    "node": {
                                        "user": {
                                            "full_name": "ریحانه | Reyhaneh",
                                            "id": "2229134530",
                                            "is_verified": false,
                                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/462ac33c91a11553aa4bd6530fec9e62/5D87C41C/t51.2885-19/s150x150/43742323_117624749173852_1867359150741127168_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                                            "username": "khamenei_reyhaneh"
                                        },
                                        "x": 0.22191402,
                                        "y": 0.7429679
                                    }
                                },
                                {
                                    "node": {
                                        "user": {
                                            "full_name": "چادریها 313 ❤",
                                            "id": "5595226915",
                                            "is_verified": false,
                                            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/7ed0b0360a7d0a076ac62ad5c3859ae7/5D8DE594/t51.2885-19/s150x150/19120457_143727069510584_8596764869900894208_a.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                                            "username": "chadoriha_313"
                                        },
                                        "x": 0.8578364,
                                        "y": 0.61504364
                                    }
                                }
                            ]
                        },
                        "gating_info": null,
                        "id": "2062328210274031685",
                        "is_video": false,
                        "media_preview": null,
                        "shortcode": "Bye3JSfpphF",
                        "should_log_client_event": false,
                        "tracking_token": "eyJ2ZXJzaW9uIjo1LCJwYXlsb2FkIjp7ImlzX2FuYWx5dGljc190cmFja2VkIjp0cnVlLCJ1dWlkIjoiNGE1ZjI4MTAzN2M2NGFkMmJkNGRhN2E0YTlmNDdmZWMyMDYyMzI4MjEwMjc0MDMxNjg1In0sInNpZ25hdHVyZSI6IiJ9"
                    }
                },
                {
                    "node": {
                        "__typename": "GraphImage",
                        "accessibility_caption": "Image may contain: text",
                        "dimensions": {
                            "height": 744,
                            "width": 1080
                        },
                        "display_resources": [
                            {
                                "config_height": 441,
                                "config_width": 640,
                                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/674cd3e7642cb4694a1c86120ed2d0e5/5D865277/t51.2885-15/sh0.08/e35/s640x640/61846633_146441106522893_7272385934691390233_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
                            },
                            {
                                "config_height": 517,
                                "config_width": 750,
                                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/269490db5ac9bc6c8e00443156306404/5DC5EF77/t51.2885-15/sh0.08/e35/s750x750/61846633_146441106522893_7272385934691390233_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
                            },
                            {
                                "config_height": 744,
                                "config_width": 1080,
                                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/cc3ea2bcc6da32e346c5eb3e4130fbc9/5DC35892/t51.2885-15/e35/61846633_146441106522893_7272385934691390233_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
                            }
                        ],
                        "display_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/cc3ea2bcc6da32e346c5eb3e4130fbc9/5DC35892/t51.2885-15/e35/61846633_146441106522893_7272385934691390233_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
                        "edge_media_to_tagged_user": {
                            "edges": []
                        },
                        "gating_info": null,
                        "id": "2062328210282420119",
                        "is_video": false,
                        "media_preview": null,
                        "shortcode": "Bye3JSgJpeX",
                        "should_log_client_event": false,
                        "tracking_token": "eyJ2ZXJzaW9uIjo1LCJwYXlsb2FkIjp7ImlzX2FuYWx5dGljc190cmFja2VkIjp0cnVlLCJ1dWlkIjoiNGE1ZjI4MTAzN2M2NGFkMmJkNGRhN2E0YTlmNDdmZWMyMDYyMzI4MjEwMjgyNDIwMTE5In0sInNpZ25hdHVyZSI6IiJ9"
                    }
                }
            ]
        },
        "edge_web_media_to_related_media": {
            "edges": []
        },
        "gating_info": null,
        "has_ranked_comments": false,
        "id": "2062328221875339168",
        "is_ad": false,
        "is_video": false,
        "location": null,
        "media_preview": null,
        "owner": {
            "blocked_by_viewer": false,
            "followed_by_viewer": false,
            "full_name": "وطن یعنی،اذانِ عشق گفتن",
            "has_blocked_viewer": false,
            "id": "3627683343",
            "is_private": false,
            "is_unpublished": false,
            "is_verified": false,
            "profile_pic_url": "https://instagram.faal2-1.fna.fbcdn.net/vp/5febb4c82c763dfcbf89bc6e213fcdda/5D88D4DB/t51.2885-19/s150x150/31978915_163771307631960_2333681741685850112_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
            "requested_by_viewer": false,
            "username": "hamed.sh313"
        },
        "shortcode": "Bye3JdTJH-g",
        "should_log_client_event": false,
        "taken_at_timestamp": 1560068703,
        "thumbnail_resources": [
            {
                "config_height": 150,
                "config_width": 150,
                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/657f12bc1fce3a02dd80c1061c4b5ceb/5D9076FE/t51.2885-15/e35/c162.0.720.720/s150x150/64252345_436298610259763_6496020972127926877_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
            },
            {
                "config_height": 240,
                "config_width": 240,
                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/623560647ef3bc5583ff5c11d397a4be/5D990DB4/t51.2885-15/e35/c162.0.720.720/s240x240/64252345_436298610259763_6496020972127926877_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
            },
            {
                "config_height": 320,
                "config_width": 320,
                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/663d1d377d0169c9b5b12014d0a79b11/5DC4D60E/t51.2885-15/e35/c162.0.720.720/s320x320/64252345_436298610259763_6496020972127926877_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
            },
            {
                "config_height": 480,
                "config_width": 480,
                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/be277ca6285af774c1fd1ae097d14fb3/5DC61654/t51.2885-15/e35/c162.0.720.720/s480x480/64252345_436298610259763_6496020972127926877_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
            },
            {
                "config_height": 640,
                "config_width": 640,
                "src": "https://instagram.faal2-1.fna.fbcdn.net/vp/2463264e8e02a991b444985641250b6f/5D8644F4/t51.2885-15/sh0.08/e35/c162.0.720.720/s640x640/64252345_436298610259763_6496020972127926877_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net"
            }
        ],
        "thumbnail_src": "https://instagram.faal2-1.fna.fbcdn.net/vp/2463264e8e02a991b444985641250b6f/5D8644F4/t51.2885-15/sh0.08/e35/c162.0.720.720/s640x640/64252345_436298610259763_6496020972127926877_n.jpg?_nc_ht=instagram.faal2-1.fna.fbcdn.net",
        "tracking_token": "eyJ2ZXJzaW9uIjo1LCJwYXlsb2FkIjp7ImlzX2FuYWx5dGljc190cmFja2VkIjp0cnVlLCJ1dWlkIjoiNGE1ZjI4MTAzN2M2NGFkMmJkNGRhN2E0YTlmNDdmZWMyMDYyMzI4MjIxODc1MzM5MTY4In0sInNpZ25hdHVyZSI6IiJ9",
        "viewer_can_reshare": true,
        "viewer_has_liked": false,
        "viewer_has_saved": false,
        "viewer_has_saved_to_collection": false,
        "viewer_in_photo_of_you": false
    }
}